# Отчёт о тестировании приложения Money Transfer

## Краткое описание

При пополнении баланса VIP-клиента банка происходит ошибка. 
Для выявления ошибки было создано базовое приложение, позволяющее воспроизвести ситуацию.

Входные данные:
* текущий баланс счёта клиента - переменная типа int, значение - 2_000_000_000 (два миллиарда рублей)
* сумма перевода - переменная типа int, значение - 500_000_000 (пятьсот миллионов рублей)
* переменная для хранения итогового значения - тип int

## Описание тестов

Было проведено позитивное функциональное тестирование.

1. Смоделировать требуемую функцию через следующий код:
```java
public class Main {
    public static void main(String[] args) {
        int CurrentBalance = 2_000_000_000;
        int TransactionSum = 500_000_000;
        int Total = CurrentBalance + TransactionSum;
        System.out.println(Total);
    }
}
```
2. Запустить код и проверить вывод.

## Результаты
В результате моделирования функции вывода результата пополнения баланса обнаружен следующий баг:
https://github.com/alexreshetnikova/MoneyTransfer/issues/1


## Общие рекомендации

Необходимо обратить внимание на ограничения в типе данных. 
Тип int используется для значений от -2 147 483 648 до 2 147 483 647.
Рекомендуется изменить тип данных одной из суммируемых переменных и тип данных переменной Total на long. 
