# Отчёт о тестировании приложения Money Transfer

## Краткое описание

При пополнении баланса VIP-клиента банка происходит ошибка. 
Для выявления ошибки было создано базовое приложение, позволяющее воспроизвести ситуацию.

Входные данные:
* текущий баланс счёта клиента - переменная типа int, значение - 2_000_000_000 (два миллиарда рублей)
* сумма перевода - переменная типа int, значение - 500_000_000 (пятьсот миллионов рублей)
* переменная для хранения итогового значения - тип int

## Описание тестов

Было проведено позитивное функциональное тестирование.

1. Смоделировать требуемую функцию через следующий код:
```java
public class Main {
    public static void main(String[] args) {
        int CurrentBalance = 2_000_000_000;
        int TransactionSum = 500_000_000;
        int Total = CurrentBalance + TransactionSum;
        System.out.println(Total);
    }
}
```
2. Запустить код и проверить вывод.

## Результаты



## Общие рекомендации

Ваши рекомендации как тестировщика по итогам тестирования.
